//
// Created by wenwe on 2021/2/13.
//

#include <oled.h>
#include <memory.h>

static uint8_t g_double_buffer[8][128];

static uint8_t font_index[] = {
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4,
        5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
        34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61,
        62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 0
};

static uint8_t fonts[] = {
/*-- ID:0,字符:" ",ASCII编码:20,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x00, 0x00, 0x00, 0x00,
/*-- ID:1,字符:"!",ASCII编码:21,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x00, 0x5F, 0x00, 0x00,
/*-- ID:2,字符:""",ASCII编码:22,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x07, 0x00, 0x07, 0x00,
/*-- ID:3,字符:"#",ASCII编码:23,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x14, 0x7F, 0x14, 0x7F, 0x14,
/*-- ID:4,字符:"$",ASCII编码:24,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x24, 0x2E, 0x7B, 0x2A, 0x12,
/*-- ID:5,字符:"%",ASCII编码:25,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x23, 0x13, 0x08, 0x64, 0x62,
/*-- ID:6,字符:"&",ASCII编码:26,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x36, 0x49, 0x56, 0x20, 0x50,
/*-- ID:7,字符:"'",ASCII编码:27,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x04, 0x03, 0x01, 0x00,
/*-- ID:8,字符:"(",ASCII编码:28,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x1C, 0x22, 0x41, 0x00,
/*-- ID:9,字符:")",ASCII编码:29,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x41, 0x22, 0x1C, 0x00,
/*-- ID:10,字符:"*",ASCII编码:2A,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x22, 0x14, 0x7F, 0x14, 0x22,
/*-- ID:11,字符:"+",ASCII编码:2B,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x08, 0x08, 0x7F, 0x08, 0x08,
/*-- ID:12,字符:",",ASCII编码:2C,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x40, 0x30, 0x10, 0x00, 0x00,
/*-- ID:13,字符:"-",ASCII编码:2D,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x08, 0x08, 0x08, 0x08, 0x08,
/*-- ID:14,字符:".",ASCII编码:2E,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x60, 0x60, 0x00, 0x00,
/*-- ID:15,字符:"/",ASCII编码:2F,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x20, 0x10, 0x08, 0x04, 0x02,
/*-- ID:16,字符:"0",ASCII编码:30,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3E, 0x51, 0x49, 0x45, 0x3E,
/*-- ID:17,字符:"1",ASCII编码:31,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x42, 0x7F, 0x40, 0x00,
/*-- ID:18,字符:"2",ASCII编码:32,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x62, 0x51, 0x49, 0x49, 0x46,
/*-- ID:19,字符:"3",ASCII编码:33,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x21, 0x41, 0x49, 0x4D, 0x33,
/*-- ID:20,字符:"4",ASCII编码:34,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x18, 0x14, 0x12, 0x7F, 0x10,
/*-- ID:21,字符:"5",ASCII编码:35,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x27, 0x45, 0x45, 0x45, 0x39,
/*-- ID:22,字符:"6",ASCII编码:36,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3C, 0x4A, 0x49, 0x49, 0x31,
/*-- ID:23,字符:"7",ASCII编码:37,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x01, 0x71, 0x09, 0x05, 0x03,
/*-- ID:24,字符:"8",ASCII编码:38,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x36, 0x49, 0x49, 0x49, 0x36,
/*-- ID:25,字符:"9",ASCII编码:39,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x46, 0x49, 0x49, 0x29, 0x1E,
/*-- ID:26,字符:":",ASCII编码:3A,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x36, 0x36, 0x00, 0x00,
/*-- ID:27,字符:";",ASCII编码:3B,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x40, 0x36, 0x36, 0x00, 0x00,
/*-- ID:28,字符:"<",ASCII编码:3C,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x08, 0x14, 0x22, 0x41, 0x00,
/*-- ID:29,字符:"=",ASCII编码:3D,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x14, 0x14, 0x14, 0x14, 0x14,
/*-- ID:30,字符:">",ASCII编码:3E,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x41, 0x22, 0x14, 0x08,
/*-- ID:31,字符:"?",ASCII编码:3F,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x02, 0x01, 0x59, 0x05, 0x02,
/*-- ID:32,字符:"@",ASCII编码:40,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3E, 0x41, 0x5D, 0x55, 0x5E,
/*-- ID:33,字符:"A",ASCII编码:41,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7C, 0x12, 0x11, 0x12, 0x7C,
/*-- ID:34,字符:"B",ASCII编码:42,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x49, 0x49, 0x49, 0x36,
/*-- ID:35,字符:"C",ASCII编码:43,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3E, 0x41, 0x41, 0x41, 0x22,
/*-- ID:36,字符:"D",ASCII编码:44,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x41, 0x41, 0x41, 0x3E,
/*-- ID:37,字符:"E",ASCII编码:45,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x49, 0x49, 0x49, 0x41,
/*-- ID:38,字符:"F",ASCII编码:46,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x09, 0x09, 0x09, 0x01,
/*-- ID:39,字符:"G",ASCII编码:47,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3E, 0x41, 0x51, 0x51, 0x72,
/*-- ID:40,字符:"H",ASCII编码:48,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x08, 0x08, 0x08, 0x7F,
/*-- ID:41,字符:"I",ASCII编码:49,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x41, 0x7F, 0x41, 0x00,
/*-- ID:42,字符:"J",ASCII编码:4A,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x20, 0x40, 0x41, 0x3F, 0x01,
/*-- ID:43,字符:"K",ASCII编码:4B,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x08, 0x14, 0x22, 0x41,
/*-- ID:44,字符:"L",ASCII编码:4C,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x40, 0x40, 0x40, 0x40,
/*-- ID:45,字符:"M",ASCII编码:4D,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x02, 0x0C, 0x02, 0x7F,
/*-- ID:46,字符:"N",ASCII编码:4E,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x04, 0x08, 0x10, 0x7F,
/*-- ID:47,字符:"O",ASCII编码:4F,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3E, 0x41, 0x41, 0x41, 0x3E,
/*-- ID:48,字符:"P",ASCII编码:50,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x09, 0x09, 0x09, 0x06,
/*-- ID:49,字符:"Q",ASCII编码:51,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3E, 0x41, 0x51, 0x21, 0x5E,
/*-- ID:50,字符:"R",ASCII编码:52,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x09, 0x19, 0x29, 0x46,
/*-- ID:51,字符:"S",ASCII编码:53,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x26, 0x49, 0x49, 0x49, 0x32,
/*-- ID:52,字符:"T",ASCII编码:54,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x01, 0x01, 0x7F, 0x01, 0x01,
/*-- ID:53,字符:"U",ASCII编码:55,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3F, 0x40, 0x40, 0x40, 0x3F,
/*-- ID:54,字符:"V",ASCII编码:56,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x1F, 0x20, 0x40, 0x20, 0x1F,
/*-- ID:55,字符:"W",ASCII编码:57,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x20, 0x18, 0x20, 0x7F,
/*-- ID:56,字符:"X",ASCII编码:58,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x63, 0x14, 0x08, 0x14, 0x63,
/*-- ID:57,字符:"Y",ASCII编码:59,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x03, 0x04, 0x78, 0x04, 0x03,
/*-- ID:58,字符:"Z",ASCII编码:5A,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x61, 0x51, 0x49, 0x45, 0x43,
/*-- ID:59,字符:"[",ASCII编码:5B,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x7F, 0x41, 0x41, 0x00,
/*-- ID:60,字符:"\",ASCII编码:5C,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x02, 0x04, 0x08, 0x10, 0x20,
/*-- ID:61,字符:"]",ASCII编码:5D,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x41, 0x41, 0x7F, 0x7F,
/*-- ID:62,字符:"^",ASCII编码:5E,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x04, 0x02, 0x7F, 0x02, 0x04,
/*-- ID:63,字符:"_",ASCII编码:5F,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x08, 0x1C, 0x2A, 0x08, 0x08,
/*-- ID:64,字符:"`",ASCII编码:60,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x00, 0x01, 0x02, 0x04,
/*-- ID:65,字符:"a",ASCII编码:61,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x24, 0x54, 0x54, 0x38, 0x40,
/*-- ID:66,字符:"b",ASCII编码:62,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x28, 0x44, 0x44, 0x38,
/*-- ID:67,字符:"c",ASCII编码:63,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x38, 0x44, 0x44, 0x44, 0x08,
/*-- ID:68,字符:"d",ASCII编码:64,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x38, 0x44, 0x44, 0x28, 0x7F,
/*-- ID:69,字符:"e",ASCII编码:65,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x38, 0x54, 0x54, 0x54, 0x08,
/*-- ID:70,字符:"f",ASCII编码:66,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x08, 0x7E, 0x09, 0x09, 0x02,
/*-- ID:71,字符:"g",ASCII编码:67,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x98, 0xA4, 0xA4, 0xA4, 0x78,
/*-- ID:72,字符:"h",ASCII编码:68,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x08, 0x04, 0x04, 0x78,
/*-- ID:73,字符:"i",ASCII编码:69,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x00, 0x79, 0x00, 0x00,
/*-- ID:74,字符:"j",ASCII编码:6A,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x80, 0x88, 0x79, 0x00,
/*-- ID:75,字符:"k",ASCII编码:6B,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x7F, 0x10, 0x28, 0x44, 0x40,
/*-- ID:76,字符:"l",ASCII编码:6C,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x41, 0x7F, 0x40, 0x00,
/*-- ID:77,字符:"m",ASCII编码:6D,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x78, 0x04, 0x78, 0x04, 0x78,
/*-- ID:78,字符:"n",ASCII编码:6E,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x04, 0x78, 0x04, 0x04, 0x78,
/*-- ID:79,字符:"o",ASCII编码:6F,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x38, 0x44, 0x44, 0x44, 0x38,
/*-- ID:80,字符:"p",ASCII编码:70,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0xFC, 0x24, 0x24, 0x24, 0x18,
/*-- ID:81,字符:"q",ASCII编码:71,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x18, 0x24, 0x24, 0x24, 0xFC,
/*-- ID:82,字符:"r",ASCII编码:72,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x04, 0x78, 0x04, 0x04, 0x08,
/*-- ID:83,字符:"s",ASCII编码:73,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x48, 0x54, 0x54, 0x54, 0x24,
/*-- ID:84,字符:"t",ASCII编码:74,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x04, 0x3F, 0x44, 0x44, 0x24,
/*-- ID:85,字符:"u",ASCII编码:75,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3C, 0x40, 0x40, 0x3C, 0x40,
/*-- ID:86,字符:"v",ASCII编码:76,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x1C, 0x20, 0x40, 0x20, 0x1C,
/*-- ID:87,字符:"w",ASCII编码:77,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x3C, 0x40, 0x3C, 0x40, 0x3C,
/*-- ID:88,字符:"x",ASCII编码:78,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x44, 0x28, 0x10, 0x28, 0x44,
/*-- ID:89,字符:"y",ASCII编码:79,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x9C, 0xA0, 0xA0, 0x90, 0x7C,
/*-- ID:90,字符:"z",ASCII编码:7A,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x44, 0x64, 0x54, 0x4C, 0x44,
/*-- ID:91,字符:"{",ASCII编码:7B,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x08, 0x36, 0x41, 0x00, 0x00,
/*-- ID:92,字符:"|",ASCII编码:7C,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x00, 0x77, 0x00, 0x00,
/*-- ID:93,字符:"}",ASCII编码:7D,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x00, 0x00, 0x41, 0x36, 0x08,
/*-- ID:94,字符:"~",ASCII编码:7E,对应字:宽x高=5x8,画布:宽W=5 高H=8,共5字节*/
        0x08, 0x04, 0x08, 0x10, 0x08
};

static void oled_send_cmd(uint8_t cmd) {
    uint8_t package[2] = {0x00, cmd};
    HAL_I2C_Master_Transmit(&hi2c1, 0x78, package, 2, 1000);
}

static void oled_send_data(uint8_t data) {
    uint8_t package[2] = {0x40, data};
    HAL_I2C_Master_Transmit(&hi2c1, 0x78, package, 2, 1000);
}

void oled_init() {
    oled_send_cmd(0xAE); // OLED OFF
    oled_send_cmd(0x00);
    oled_send_cmd(0x10); // column address 0x00
    oled_send_cmd(0x81);
    oled_send_cmd(0xFF); // highest contrast
    oled_send_data(0x10); // page addressing mode
    oled_send_cmd(0xAF);
    oled_cls();
    oled_update();
}

void oled_set_row(uint8_t row) {
    oled_send_cmd(0xB0 | row);
}

void oled_set_col(uint8_t col) {
    col += 2;
    oled_send_cmd(0x00 | (col & 0x0F));
    oled_send_cmd(0x10 | (col >> 4));
}

void oled_cls() {
    memset(g_double_buffer, 0, sizeof(g_double_buffer));
}

void oled_put_str(const char *p_str, uint8_t start_row, uint8_t start_col) {
    oled_set_row(start_row);
    oled_set_col(start_col);
    for (int i = 0; p_str[i] != 0; ++i) {
        for (int j = 0; j < 5; ++j) {
            g_double_buffer[start_row][start_col++] = fonts[font_index[p_str[i]] * 5 + j];
            if (start_col == 128) return; // NO MORE SPACE
        }
    }
}

void oled_update() {
    for (int i = 0; i < 8; ++i) {
        oled_set_row(i);
        oled_set_col(0);
        for (int c = 0; c < 128; ++c) {
            oled_send_data(g_double_buffer[i][c]);
        }
    }
}
